tests/Chisel.Tests/DependencyGraphTest.EfCoreBulkExtensionsGraph_format=graphviz.verified.gv
# Generated by https://github.com/0xced/Chisel

digraph
{
  rankdir=LR
  node [ fontname = "Segoe UI, sans-serif", shape = box, style = filled, fillcolor = aquamarine, color = "#009061", fontcolor = "#333333" ]

  "dotMorten.Microsoft.SqlServer.Types" -> "System.Data.SqlClient"
  "dotMorten.Microsoft.SqlServer.Types" -> "System.Memory"
  "EFCore.BulkExtensions" -> "dotMorten.Microsoft.SqlServer.Types"
  "EFCore.BulkExtensions" -> "EntityFrameworkCore.SqlServer.HierarchyId"
  "EFCore.BulkExtensions" -> "Microsoft.Data.SqlClient"
  "EFCore.BulkExtensions" -> "Microsoft.EntityFrameworkCore"
  "EFCore.BulkExtensions" -> "Microsoft.EntityFrameworkCore.Relational"
  "EFCore.BulkExtensions" -> "Microsoft.EntityFrameworkCore.Sqlite"
  "EFCore.BulkExtensions" -> "NetTopologySuite.IO.SqlServerBytes"
  "EFCore.BulkExtensions" -> "System.Data.SqlClient"
  "EFCore.BulkExtensions" -> "System.Diagnostics.DiagnosticSource"
  "EntityFrameworkCore.SqlServer.HierarchyId" -> "EntityFrameworkCore.SqlServer.HierarchyId.Abstractions"
  "EntityFrameworkCore.SqlServer.HierarchyId" -> "Microsoft.EntityFrameworkCore.SqlServer"
  "EntityFrameworkCore.SqlServer.HierarchyId.Abstractions" -> "Microsoft.SqlServer.Types"
  "Microsoft.Bcl.AsyncInterfaces" -> "System.Threading.Tasks.Extensions"
  "Microsoft.Data.SqlClient" -> "Microsoft.Data.SqlClient.SNI"
  "Microsoft.Data.SqlClient" -> "Microsoft.Identity.Client"
  "Microsoft.Data.SqlClient" -> "Microsoft.IdentityModel.JsonWebTokens"
  "Microsoft.Data.SqlClient" -> "Microsoft.IdentityModel.Protocols.OpenIdConnect"
  "Microsoft.Data.Sqlite.Core" -> "SQLitePCLRaw.core"
  "Microsoft.DotNet.PlatformAbstractions" -> "System.Runtime.InteropServices.RuntimeInformation"
  "Microsoft.EntityFrameworkCore" -> "Microsoft.Bcl.AsyncInterfaces"
  "Microsoft.EntityFrameworkCore" -> "Microsoft.Bcl.HashCode"
  "Microsoft.EntityFrameworkCore" -> "Microsoft.EntityFrameworkCore.Abstractions"
  "Microsoft.EntityFrameworkCore" -> "Microsoft.EntityFrameworkCore.Analyzers"
  "Microsoft.EntityFrameworkCore" -> "Microsoft.Extensions.Caching.Memory"
  "Microsoft.EntityFrameworkCore" -> "Microsoft.Extensions.DependencyInjection"
  "Microsoft.EntityFrameworkCore" -> "Microsoft.Extensions.Logging"
  "Microsoft.EntityFrameworkCore" -> "System.Collections.Immutable"
  "Microsoft.EntityFrameworkCore" -> "System.ComponentModel.Annotations"
  "Microsoft.EntityFrameworkCore" -> "System.Diagnostics.DiagnosticSource"
  "Microsoft.EntityFrameworkCore.Relational" -> "Microsoft.EntityFrameworkCore"
  "Microsoft.EntityFrameworkCore.Sqlite" -> "Microsoft.EntityFrameworkCore.Sqlite.Core"
  "Microsoft.EntityFrameworkCore.Sqlite" -> "SQLitePCLRaw.bundle_e_sqlite3"
  "Microsoft.EntityFrameworkCore.Sqlite.Core" -> "Microsoft.Data.Sqlite.Core"
  "Microsoft.EntityFrameworkCore.Sqlite.Core" -> "Microsoft.DotNet.PlatformAbstractions"
  "Microsoft.EntityFrameworkCore.Sqlite.Core" -> "Microsoft.EntityFrameworkCore.Relational"
  "Microsoft.EntityFrameworkCore.Sqlite.Core" -> "Microsoft.Extensions.DependencyModel"
  "Microsoft.EntityFrameworkCore.SqlServer" -> "Microsoft.Data.SqlClient"
  "Microsoft.EntityFrameworkCore.SqlServer" -> "Microsoft.EntityFrameworkCore.Relational"
  "Microsoft.Extensions.Caching.Abstractions" -> "Microsoft.Extensions.Primitives"
  "Microsoft.Extensions.Caching.Memory" -> "Microsoft.Extensions.Caching.Abstractions"
  "Microsoft.Extensions.Caching.Memory" -> "Microsoft.Extensions.DependencyInjection.Abstractions"
  "Microsoft.Extensions.Caching.Memory" -> "Microsoft.Extensions.Logging.Abstractions"
  "Microsoft.Extensions.Caching.Memory" -> "Microsoft.Extensions.Options"
  "Microsoft.Extensions.Configuration" -> "Microsoft.Extensions.Configuration.Abstractions"
  "Microsoft.Extensions.Configuration.Abstractions" -> "Microsoft.Extensions.Primitives"
  "Microsoft.Extensions.Configuration.Binder" -> "Microsoft.Extensions.Configuration"
  "Microsoft.Extensions.DependencyInjection" -> "Microsoft.Bcl.AsyncInterfaces"
  "Microsoft.Extensions.DependencyInjection" -> "Microsoft.Extensions.DependencyInjection.Abstractions"
  "Microsoft.Extensions.DependencyModel" -> "Newtonsoft.Json"
  "Microsoft.Extensions.DependencyModel" -> "System.Runtime.InteropServices.RuntimeInformation"
  "Microsoft.Extensions.Logging" -> "Microsoft.Extensions.Configuration.Binder"
  "Microsoft.Extensions.Logging" -> "Microsoft.Extensions.DependencyInjection"
  "Microsoft.Extensions.Logging" -> "Microsoft.Extensions.Logging.Abstractions"
  "Microsoft.Extensions.Logging" -> "Microsoft.Extensions.Options"
  "Microsoft.Extensions.Options" -> "Microsoft.Extensions.DependencyInjection.Abstractions"
  "Microsoft.Extensions.Options" -> "Microsoft.Extensions.Primitives"
  "Microsoft.Extensions.Options" -> "System.ComponentModel.Annotations"
  "Microsoft.Extensions.Primitives" -> "System.Memory"
  "Microsoft.Extensions.Primitives" -> "System.Runtime.CompilerServices.Unsafe"
  "Microsoft.IdentityModel.JsonWebTokens" -> "Microsoft.IdentityModel.Tokens"
  "Microsoft.IdentityModel.Protocols" -> "Microsoft.IdentityModel.Logging"
  "Microsoft.IdentityModel.Protocols" -> "Microsoft.IdentityModel.Tokens"
  "Microsoft.IdentityModel.Protocols.OpenIdConnect" -> "Microsoft.IdentityModel.Protocols"
  "Microsoft.IdentityModel.Protocols.OpenIdConnect" -> "System.IdentityModel.Tokens.Jwt"
  "Microsoft.IdentityModel.Tokens" -> "Microsoft.IdentityModel.Logging"
  "Microsoft.NETFramework.ReferenceAssemblies" -> "Microsoft.NETFramework.ReferenceAssemblies.net48"
  "NetTopologySuite" -> "System.Memory"
  "NetTopologySuite.IO.SqlServerBytes" -> "NetTopologySuite"
  "SQLitePCLRaw.bundle_e_sqlite3" -> "SQLitePCLRaw.core"
  "SQLitePCLRaw.bundle_e_sqlite3" -> "SQLitePCLRaw.lib.e_sqlite3"
  "SQLitePCLRaw.bundle_e_sqlite3" -> "SQLitePCLRaw.provider.dynamic_cdecl"
  "SQLitePCLRaw.core" -> "System.Memory"
  "SQLitePCLRaw.provider.dynamic_cdecl" -> "SQLitePCLRaw.core"
  "System.Collections.Immutable" -> "System.Memory"
  "System.Diagnostics.DiagnosticSource" -> "System.Memory"
  "System.Diagnostics.DiagnosticSource" -> "System.Runtime.CompilerServices.Unsafe"
  "System.IdentityModel.Tokens.Jwt" -> "Microsoft.IdentityModel.JsonWebTokens"
  "System.IdentityModel.Tokens.Jwt" -> "Microsoft.IdentityModel.Tokens"
  "System.Memory" -> "System.Buffers"
  "System.Memory" -> "System.Numerics.Vectors"
  "System.Memory" -> "System.Runtime.CompilerServices.Unsafe"
  "System.Threading.Tasks.Extensions" -> "System.Runtime.CompilerServices.Unsafe"

  "dotMorten.Microsoft.SqlServer.Types"
  "EFCore.BulkExtensions" [ shape = hexagon, penwidth = 4 ]
  "EntityFrameworkCore.SqlServer.HierarchyId"
  "EntityFrameworkCore.SqlServer.HierarchyId.Abstractions"
  "Microsoft.Bcl.AsyncInterfaces"
  "Microsoft.Bcl.HashCode"
  "Microsoft.Data.SqlClient"
  "Microsoft.Data.SqlClient.SNI" [ fillcolor = ghostwhite, color = "#A1A1A6" ]
  "Microsoft.Data.Sqlite.Core" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "Microsoft.DotNet.PlatformAbstractions" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "Microsoft.EntityFrameworkCore"
  "Microsoft.EntityFrameworkCore.Abstractions"
  "Microsoft.EntityFrameworkCore.Analyzers" [ fillcolor = ghostwhite, color = "#A1A1A6" ]
  "Microsoft.EntityFrameworkCore.Relational"
  "Microsoft.EntityFrameworkCore.Sqlite" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "Microsoft.EntityFrameworkCore.Sqlite.Core" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "Microsoft.EntityFrameworkCore.SqlServer"
  "Microsoft.Extensions.Caching.Abstractions"
  "Microsoft.Extensions.Caching.Memory"
  "Microsoft.Extensions.Configuration"
  "Microsoft.Extensions.Configuration.Abstractions"
  "Microsoft.Extensions.Configuration.Binder"
  "Microsoft.Extensions.DependencyInjection"
  "Microsoft.Extensions.DependencyInjection.Abstractions"
  "Microsoft.Extensions.DependencyModel" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "Microsoft.Extensions.Logging"
  "Microsoft.Extensions.Logging.Abstractions"
  "Microsoft.Extensions.Options"
  "Microsoft.Extensions.Primitives"
  "Microsoft.Identity.Client"
  "Microsoft.IdentityModel.JsonWebTokens"
  "Microsoft.IdentityModel.Logging"
  "Microsoft.IdentityModel.Protocols"
  "Microsoft.IdentityModel.Protocols.OpenIdConnect"
  "Microsoft.IdentityModel.Tokens"
  "Microsoft.NETFramework.ReferenceAssemblies" [ shape = hexagon, penwidth = 4, fillcolor = ghostwhite, color = "#A1A1A6" ]
  "Microsoft.NETFramework.ReferenceAssemblies.net48" [ fillcolor = ghostwhite, color = "#A1A1A6" ]
  "Microsoft.SqlServer.Types"
  "NetTopologySuite"
  "NetTopologySuite.IO.SqlServerBytes"
  "Newtonsoft.Json" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "SQLitePCLRaw.bundle_e_sqlite3" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "SQLitePCLRaw.core" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "SQLitePCLRaw.lib.e_sqlite3" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "SQLitePCLRaw.provider.dynamic_cdecl" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "System.Buffers"
  "System.Collections.Immutable"
  "System.ComponentModel.Annotations"
  "System.Data.SqlClient"
  "System.Diagnostics.DiagnosticSource"
  "System.IdentityModel.Tokens.Jwt"
  "System.Memory"
  "System.Numerics.Vectors"
  "System.Runtime.CompilerServices.Unsafe"
  "System.Runtime.InteropServices.RuntimeInformation" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "System.Threading.Tasks.Extensions"
}
