tests/Chisel.Tests/DependencyGraphTest.EfCoreBulkExtensionsGraph_format=mermaid.verified.mmd
%% Generated by https://github.com/0xced/Chisel

graph LR

classDef root stroke-width:4px
classDef default fill:aquamarine,stroke:#009061,color:#333333
classDef removed fill:lightcoral,stroke:#A42A2A
classDef meta fill:ghostwhite,stroke:#A1A1A6

dotMorten.Microsoft.SqlServer.Types --> System.Data.SqlClient
dotMorten.Microsoft.SqlServer.Types --> System.Memory
EFCore.BulkExtensions{{EFCore.BulkExtensions}} --> dotMorten.Microsoft.SqlServer.Types
EFCore.BulkExtensions --> EntityFrameworkCore.SqlServer.HierarchyId
EFCore.BulkExtensions --> Microsoft.Data.SqlClient
EFCore.BulkExtensions --> Microsoft.EntityFrameworkCore
EFCore.BulkExtensions --> Microsoft.EntityFrameworkCore.Relational
EFCore.BulkExtensions --> Microsoft.EntityFrameworkCore.Sqlite
EFCore.BulkExtensions --> NetTopologySuite.IO.SqlServerBytes
EFCore.BulkExtensions --> System.Data.SqlClient
EFCore.BulkExtensions --> System.Diagnostics.DiagnosticSource
EntityFrameworkCore.SqlServer.HierarchyId --> EntityFrameworkCore.SqlServer.HierarchyId.Abstractions
EntityFrameworkCore.SqlServer.HierarchyId --> Microsoft.EntityFrameworkCore.SqlServer
EntityFrameworkCore.SqlServer.HierarchyId.Abstractions --> Microsoft.SqlServer.Types
Microsoft.Bcl.AsyncInterfaces --> System.Threading.Tasks.Extensions
Microsoft.Data.SqlClient --> Microsoft.Data.SqlClient.SNI
Microsoft.Data.SqlClient --> Microsoft.Identity.Client
Microsoft.Data.SqlClient --> Microsoft.IdentityModel.JsonWebTokens
Microsoft.Data.SqlClient --> Microsoft.IdentityModel.Protocols.OpenIdConnect
Microsoft.Data.Sqlite.Core --> SQLitePCLRaw.core
Microsoft.DotNet.PlatformAbstractions --> System.Runtime.InteropServices.RuntimeInformation
Microsoft.EntityFrameworkCore --> Microsoft.Bcl.AsyncInterfaces
Microsoft.EntityFrameworkCore --> Microsoft.Bcl.HashCode
Microsoft.EntityFrameworkCore --> Microsoft.EntityFrameworkCore.Abstractions
Microsoft.EntityFrameworkCore --> Microsoft.EntityFrameworkCore.Analyzers
Microsoft.EntityFrameworkCore --> Microsoft.Extensions.Caching.Memory
Microsoft.EntityFrameworkCore --> Microsoft.Extensions.DependencyInjection
Microsoft.EntityFrameworkCore --> Microsoft.Extensions.Logging
Microsoft.EntityFrameworkCore --> System.Collections.Immutable
Microsoft.EntityFrameworkCore --> System.ComponentModel.Annotations
Microsoft.EntityFrameworkCore --> System.Diagnostics.DiagnosticSource
Microsoft.EntityFrameworkCore.Relational --> Microsoft.EntityFrameworkCore
Microsoft.EntityFrameworkCore.Sqlite --> Microsoft.EntityFrameworkCore.Sqlite.Core
Microsoft.EntityFrameworkCore.Sqlite --> SQLitePCLRaw.bundle_e_sqlite3
Microsoft.EntityFrameworkCore.Sqlite.Core --> Microsoft.Data.Sqlite.Core
Microsoft.EntityFrameworkCore.Sqlite.Core --> Microsoft.DotNet.PlatformAbstractions
Microsoft.EntityFrameworkCore.Sqlite.Core --> Microsoft.EntityFrameworkCore.Relational
Microsoft.EntityFrameworkCore.Sqlite.Core --> Microsoft.Extensions.DependencyModel
Microsoft.EntityFrameworkCore.SqlServer --> Microsoft.Data.SqlClient
Microsoft.EntityFrameworkCore.SqlServer --> Microsoft.EntityFrameworkCore.Relational
Microsoft.Extensions.Caching.Abstractions --> Microsoft.Extensions.Primitives
Microsoft.Extensions.Caching.Memory --> Microsoft.Extensions.Caching.Abstractions
Microsoft.Extensions.Caching.Memory --> Microsoft.Extensions.DependencyInjection.Abstractions
Microsoft.Extensions.Caching.Memory --> Microsoft.Extensions.Logging.Abstractions
Microsoft.Extensions.Caching.Memory --> Microsoft.Extensions.Options
Microsoft.Extensions.Configuration --> Microsoft.Extensions.Configuration.Abstractions
Microsoft.Extensions.Configuration.Abstractions --> Microsoft.Extensions.Primitives
Microsoft.Extensions.Configuration.Binder --> Microsoft.Extensions.Configuration
Microsoft.Extensions.DependencyInjection --> Microsoft.Bcl.AsyncInterfaces
Microsoft.Extensions.DependencyInjection --> Microsoft.Extensions.DependencyInjection.Abstractions
Microsoft.Extensions.DependencyModel --> Newtonsoft.Json
Microsoft.Extensions.DependencyModel --> System.Runtime.InteropServices.RuntimeInformation
Microsoft.Extensions.Logging --> Microsoft.Extensions.Configuration.Binder
Microsoft.Extensions.Logging --> Microsoft.Extensions.DependencyInjection
Microsoft.Extensions.Logging --> Microsoft.Extensions.Logging.Abstractions
Microsoft.Extensions.Logging --> Microsoft.Extensions.Options
Microsoft.Extensions.Options --> Microsoft.Extensions.DependencyInjection.Abstractions
Microsoft.Extensions.Options --> Microsoft.Extensions.Primitives
Microsoft.Extensions.Options --> System.ComponentModel.Annotations
Microsoft.Extensions.Primitives --> System.Memory
Microsoft.Extensions.Primitives --> System.Runtime.CompilerServices.Unsafe
Microsoft.IdentityModel.JsonWebTokens --> Microsoft.IdentityModel.Tokens
Microsoft.IdentityModel.Protocols --> Microsoft.IdentityModel.Logging
Microsoft.IdentityModel.Protocols --> Microsoft.IdentityModel.Tokens
Microsoft.IdentityModel.Protocols.OpenIdConnect --> Microsoft.IdentityModel.Protocols
Microsoft.IdentityModel.Protocols.OpenIdConnect --> System.IdentityModel.Tokens.Jwt
Microsoft.IdentityModel.Tokens --> Microsoft.IdentityModel.Logging
Microsoft.NETFramework.ReferenceAssemblies{{Microsoft.NETFramework.ReferenceAssemblies}} --> Microsoft.NETFramework.ReferenceAssemblies.net48
NetTopologySuite --> System.Memory
NetTopologySuite.IO.SqlServerBytes --> NetTopologySuite
SQLitePCLRaw.bundle_e_sqlite3 --> SQLitePCLRaw.core
SQLitePCLRaw.bundle_e_sqlite3 --> SQLitePCLRaw.lib.e_sqlite3
SQLitePCLRaw.bundle_e_sqlite3 --> SQLitePCLRaw.provider.dynamic_cdecl
SQLitePCLRaw.core --> System.Memory
SQLitePCLRaw.provider.dynamic_cdecl --> SQLitePCLRaw.core
System.Collections.Immutable --> System.Memory
System.Diagnostics.DiagnosticSource --> System.Memory
System.Diagnostics.DiagnosticSource --> System.Runtime.CompilerServices.Unsafe
System.IdentityModel.Tokens.Jwt --> Microsoft.IdentityModel.JsonWebTokens
System.IdentityModel.Tokens.Jwt --> Microsoft.IdentityModel.Tokens
System.Memory --> System.Buffers
System.Memory --> System.Numerics.Vectors
System.Memory --> System.Runtime.CompilerServices.Unsafe
System.Threading.Tasks.Extensions --> System.Runtime.CompilerServices.Unsafe

class dotMorten.Microsoft.SqlServer.Types default
class EFCore.BulkExtensions root
class EFCore.BulkExtensions default
class EntityFrameworkCore.SqlServer.HierarchyId default
class EntityFrameworkCore.SqlServer.HierarchyId.Abstractions default
class Microsoft.Bcl.AsyncInterfaces default
class Microsoft.Bcl.HashCode default
class Microsoft.Data.SqlClient default
class Microsoft.Data.SqlClient.SNI meta
class Microsoft.Data.Sqlite.Core removed
class Microsoft.DotNet.PlatformAbstractions removed
class Microsoft.EntityFrameworkCore default
class Microsoft.EntityFrameworkCore.Abstractions default
class Microsoft.EntityFrameworkCore.Analyzers meta
class Microsoft.EntityFrameworkCore.Relational default
class Microsoft.EntityFrameworkCore.Sqlite removed
class Microsoft.EntityFrameworkCore.Sqlite.Core removed
class Microsoft.EntityFrameworkCore.SqlServer default
class Microsoft.Extensions.Caching.Abstractions default
class Microsoft.Extensions.Caching.Memory default
class Microsoft.Extensions.Configuration default
class Microsoft.Extensions.Configuration.Abstractions default
class Microsoft.Extensions.Configuration.Binder default
class Microsoft.Extensions.DependencyInjection default
class Microsoft.Extensions.DependencyInjection.Abstractions default
class Microsoft.Extensions.DependencyModel removed
class Microsoft.Extensions.Logging default
class Microsoft.Extensions.Logging.Abstractions default
class Microsoft.Extensions.Options default
class Microsoft.Extensions.Primitives default
class Microsoft.Identity.Client default
class Microsoft.IdentityModel.JsonWebTokens default
class Microsoft.IdentityModel.Logging default
class Microsoft.IdentityModel.Protocols default
class Microsoft.IdentityModel.Protocols.OpenIdConnect default
class Microsoft.IdentityModel.Tokens default
class Microsoft.NETFramework.ReferenceAssemblies root
class Microsoft.NETFramework.ReferenceAssemblies meta
class Microsoft.NETFramework.ReferenceAssemblies.net48 meta
class Microsoft.SqlServer.Types default
class NetTopologySuite default
class NetTopologySuite.IO.SqlServerBytes default
class Newtonsoft.Json removed
class SQLitePCLRaw.bundle_e_sqlite3 removed
class SQLitePCLRaw.core removed
class SQLitePCLRaw.lib.e_sqlite3 removed
class SQLitePCLRaw.provider.dynamic_cdecl removed
class System.Buffers default
class System.Collections.Immutable default
class System.ComponentModel.Annotations default
class System.Data.SqlClient default
class System.Diagnostics.DiagnosticSource default
class System.IdentityModel.Tokens.Jwt default
class System.Memory default
class System.Numerics.Vectors default
class System.Runtime.CompilerServices.Unsafe default
class System.Runtime.InteropServices.RuntimeInformation removed
class System.Threading.Tasks.Extensions default
